backend/performance/artillery-resource.yml
config:
  target: 'http://localhost:5000'
  
  phases:
    - duration: 30
      arrivalRate: 3
      name: "Warm up"
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: "Ramp up"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
    - duration: 30
      arrivalRate: 3
      name: "Cool down"

  http:
    timeout: 10

  variables:
    projectId: '69d8c8dba3f6f280f1027d18'
    resourceId: 'mock-resource-001'
    corporateId: 'mock-corporate-001'
    corporateEmail: 'corporate@example.com'
    corporatePassword: 'TestPass123!'

scenarios:
  # Test 1: View Resource Status (Public endpoints)
  - name: "Resource - View Status"
    weight: 30
    flow:
      - get:
          url: "/api/resources/project/{{ projectId }}/status"
          expect:
            - statusCode: 200
            - contentType: json
            - max: 200
      - think: 1
      - get:
          url: "/api/resources/project/{{ projectId }}"
          expect:
            - statusCode: 200
            - contentType: json
            - max: 200
      - think: 1
      - get:
          url: "/api/resources/all?page=1&limit=10"
          expect:
            - statusCode: 200
            - contentType: json
            - max: 200
      - think: 2

  # Test 2: Get Single Resource
  - name: "Resource - Get Single"
    weight: 20
    flow:
      - get:
          url: "/api/resources/{{ resourceId }}"
          expect:
            - statusCode: 200
            - contentType: json
            - max: 150
      - think: 1

  # Test 3: Corporate Donation Workflow
  - name: "Resource - Corporate Donation"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ corporateEmail }}"
            password: "{{ corporatePassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
            - max: 300
      - think: 1
      - post:
          url: "/api/resources/{{ projectId }}/donate"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Gloves"
            quantity: 5
            corporateId: "{{ corporateId }}"
            description: "Performance test donation"
          expect:
            - statusCode: 200
            - max: 400
      - think: 1
      - get:
          url: "/api/resources/project/{{ projectId }}/status"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - max: 200
      - think: 2

  # Test 4: Error Scenarios
  - name: "Resource - Error Handling"
    weight: 20
    flow:
      - post:
          url: "/api/resources/{{ projectId }}/donate"
          json:
            name: "Gloves"
            quantity: 1000
            corporateId: "{{ corporateId }}"
          expect:
            - statusCode: 400
            - max: 200
      - think: 1
      - get:
          url: "/api/resources/invalid-resource-id"
          expect:
            - statusCode: 404
            - max: 150
      - think: 1
      - post:
          url: "/api/resources/{{ projectId }}/donate"
          json:
            name: "Gloves"
            quantity: 5
          expect:
            - statusCode: 401
            - max: 200
      - think: 2